<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"74785101142b0b3318dca7f16c9cb6f83ee4cbe9b8a36850faa2b7aca1999d90","plan_job_ref":"Job Test plan target and replace #308 at https://github.com/dflook/terraform-github-actions/actions/runs/4028991200","plan_hash":"9924d1a27cd9dafa48f63de6b68cff727e66f421a721780601f3a638323fdf69","plan_text_format":"text","version":"1.31.1"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "G9KcdzqDZ8" -> (known after apply)
  ~ foreach = "vNZGfafIq9" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #308](https://github.com/dflook/terraform-github-actions/actions/runs/4028991200)